# INCLASS NOTEBOOKS DAY-03

In [1]:
import pandas as pd

## Merge

In [2]:
left_frame = pd.DataFrame({'key': range(5), 
                           'left_value': ['a', 'b', 'c', 'd', 'e']})
right_frame = pd.DataFrame({'key': range(2, 7), 
                           'right_value': ['f', 'g', 'h', 'i', 'j']})
print(left_frame)
print('\n')
print(right_frame)

   key left_value
0    0          a
1    1          b
2    2          c
3    3          d
4    4          e


   key right_value
0    2           f
1    3           g
2    4           h
3    5           i
4    6           j

##  Inner Join

In [3]:
pd.merge(left_frame, right_frame, on='key', how='inner')

   key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h

## Left Join

In [4]:
pd.merge(left_frame, right_frame, on='key', how='left')

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c           f
3    3          d           g
4    4          e           h

## Right Join

In [5]:
pd.merge(left_frame, right_frame, on='key', how='right')

   key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h
3    5        NaN           i
4    6        NaN           j

## Outer Join

In [6]:
pd.merge(left_frame, right_frame, on='key', how='outer')

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c           f
3    3          d           g
4    4          e           h
5    5        NaN           i
6    6        NaN           j

## Merge on Index

Join can be used to combine columns of 2 dataframes that have different index values into a signle dataframe

The one difference between merge and join is that, merge uses common columns to combine two dataframes, whereas join uses the row index to join two dataframes

In [7]:
Table1 = pd.DataFrame({'Q1': ['101', '102', '103'],
                     'Q2': ['201', '202', '203']},
                      index=['I0', 'I1', 'I2']) 

Table2 = pd.DataFrame({'Q3': ['301', '302', '303'],
                    'Q4': ['401', '402', '403']},
                      index=['I0', 'I2', 'I3'])

In [8]:
Table1.join(Table2)

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I1  102  202  NaN  NaN
I2  103  203  302  402

In [9]:
Table1.join(Table2, how='outer')

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I1  102  202  NaN  NaN
I2  103  203  302  402
I3  NaN  NaN  303  403

## Concatenate

In [10]:
pd.concat([left_frame, right_frame])

C:\Users\DILIP\AppData\Local\Continuum\anaconda1\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c         NaN
3    3          d         NaN
4    4          e         NaN
0    2        NaN           f
1    3        NaN           g
2    4        NaN           h
3    5        NaN           i
4    6        NaN           j

In [12]:
pd.concat([left_frame, right_frame], axis=1)

   key left_value  key right_value
0    0          a    2           f
1    1          b    3           g
2    2          c    4           h
3    3          d    5           i
4    4          e    6           j

## Combining

## Lets combine the two dataframes

In [13]:
df=left_frame.append(right_frame, sort=True)

In [14]:
df

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c         NaN
3    3          d         NaN
4    4          e         NaN
0    2        NaN           f
1    3        NaN           g
2    4        NaN           h
3    5        NaN           i
4    6        NaN           j

## Ignoring indexes on the concatenation axis

In [15]:
result = left_frame.append(right_frame, ignore_index=True)

In [16]:
result

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c         NaN
3    3          d         NaN
4    4          e         NaN
5    2        NaN           f
6    3        NaN           g
7    4        NaN           h
8    5        NaN           i
9    6        NaN           j

## Reshaping

## Lets `Reshape` the data frame using 'melt' function

In [0]:
import pandas as pd
data = pd.read_csv("weather.csv")
data

         day  chicago  chennai  berlin
0     Monday       32       75      41
1    Tuesday       30       77      43
2  Wednesday       28       75      45
3   Thursday       22       82      38
4     Friday       30       83      30
5   Saturday       20       81      45
6     Sunday       25       77      47

Each column above represents the temperature at three different cities from monday to friday

## Lets transform the above table into three columns(Day, city and temperature)

In [0]:
df1=pd.melt(data, id_vars = ["day"], var_name ="city", value_name="temperature")
df1

          day     city  temperature
0      Monday  chicago           32
1     Tuesday  chicago           30
2   Wednesday  chicago           28
3    Thursday  chicago           22
4      Friday  chicago           30
5    Saturday  chicago           20
6      Sunday  chicago           25
7      Monday  chennai           75
8     Tuesday  chennai           77
9   Wednesday  chennai           75
10   Thursday  chennai           82
11     Friday  chennai           83
12   Saturday  chennai           81
13     Sunday  chennai           77
14     Monday   berlin           41
15    Tuesday   berlin           43
16  Wednesday   berlin           45
17   Thursday   berlin           38
18     Friday   berlin           30
19   Saturday   berlin           45
20     Sunday   berlin           47

## Lets filter the data only for chicago

In [0]:
df1[df1["city"]=="chicago"]

         day     city  temperature
0     Monday  chicago           32
1    Tuesday  chicago           30
2  Wednesday  chicago           28
3   Thursday  chicago           22
4     Friday  chicago           30
5   Saturday  chicago           20
6     Sunday  chicago           25

## Pivoting

In [0]:
import pandas as pd
import numpy as np
df = pd.read_csv("humidity.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

## Lets reshape our data : Row = city and date , Column = Temperatre and Humidity

In [0]:
df.pivot(index='date', columns='city')

         temperature                 humidity
city         beijing mumbai new york  beijing mumbai new york
date
5/1/2017          80     75       65       26     80       56
5/2/2017          77     78       66       30     83       58
5/3/2017          79     82       68       35     85       60

## Lets reshape our data : Row = city and humidity , Column = Temperatre and date

In [0]:
df.pivot(index='humidity',columns='city')

              date                     temperature
city       beijing    mumbai  new york     beijing mumbai new york
humidity
26        5/1/2017       NaN       NaN        80.0    NaN      NaN
30        5/2/2017       NaN       NaN        77.0    NaN      NaN
35        5/3/2017       NaN       NaN        79.0    NaN      NaN
56             NaN       NaN  5/1/2017         NaN    NaN     65.0
58             NaN       NaN  5/2/2017         NaN    NaN     66.0
60             NaN       NaN  5/3/2017         NaN    NaN     68.0
80             NaN  5/1/2017       NaN         NaN   75.0      NaN
83             NaN  5/2/2017       NaN         NaN   78.0      NaN
85             NaN  5/3/2017       NaN         NaN   82.0      NaN

## Lets display the dataframe only for humidity

In [0]:
df.pivot(index='date',columns='city', values= "humidity")

city      beijing  mumbai  new york
date
5/1/2017       26      80        56
5/2/2017       30      83        58
5/3/2017       35      85        60

## Pivoting Table

In [0]:
df = pd.read_csv("Humidity1.csv")
df

         date      city  temperature  humidity
0  05-01-2017  new york           65        56
1  05-01-2017  new york           61        54
2  05-02-2017  new york           70        60
3  05-02-2017  new york           71        62
4  05-01-2017    mumbai           75        80
5  05-01-2017    mumbai           78        83
6  05-02-2017    mumbai           82        85
7  05-02-2017    mumbai           80        26

In the above table, the temperature is given for morning and evening for the same date.

## Lets create a data frame which contains the average temperaure for all the days

In [0]:
df.pivot_table(index="city",columns="date")

           humidity            temperature
date     05-01-2017 05-02-2017  05-01-2017 05-02-2017
city
mumbai         81.5       55.5        76.5       81.0
new york       55.0       61.0        63.0       70.5

## Duplicating

In [0]:
df = pd.read_csv("Humidity1.csv")
df

         date      city  temperature  humidity
0  05-01-2017  new york           65        56
1  05-01-2017  new york           61        54
2  05-02-2017  new york           70        60
3  05-02-2017  new york           71        62
4  05-01-2017    mumbai           75        80
5  05-01-2017    mumbai           78        83
6  05-02-2017    mumbai           82        85
7  05-02-2017    mumbai           80        26

## Lets check which rows are duplicated

In [0]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

False means no duplication. We checked for the entire row. None of the row is matching with each other completely.

## Lets check for the duplication in certain columns

In [0]:
df.duplicated(['date'])

0    False
1     True
2    False
3     True
4     True
5     True
6     True
7     True
dtype: bool

## Lets check for the duplication in two columns together?

In [0]:
df.duplicated(['date','city'])

0    False
1     True
2    False
3     True
4    False
5     True
6    False
7     True
dtype: bool

In [0]:
df.duplicated(['date','city'], keep='last')

0     True
1    False
2     True
3    False
4     True
5    False
6     True
7    False
dtype: bool

Keep=last will throw false when the row is repeated from second time.

## Lets drop duplicates by considering city

In [0]:
df.drop_duplicates(['city'])

         date      city  temperature  humidity
0  05-01-2017  new york           65        56
4  05-01-2017    mumbai           75        80

## Mapping

In [0]:
Season = {'new york':'winter', 'mumbai':'summer'}

## Now lets map the above dataframe "season" in our previous dataframe.

In [0]:
df['Season']=df['city'].map(Season)
df

         date      city  temperature  humidity  Season
0  05-01-2017  new york           65        56  winter
1  05-01-2017  new york           61        54  winter
2  05-02-2017  new york           70        60  winter
3  05-02-2017  new york           71        62  winter
4  05-01-2017    mumbai           75        80  summer
5  05-01-2017    mumbai           78        83  summer
6  05-02-2017    mumbai           82        85  summer
7  05-02-2017    mumbai           80        26  summer

## Replacing

Replace is used to replace any value in the dataframe. Lets replace the city new york with some other city

In [0]:
df['city'].replace('new york','Italy')

0     Italy
1     Italy
2     Italy
3     Italy
4    mumbai
5    mumbai
6    mumbai
7    mumbai
Name: city, dtype: object

## Renaming

## Lets rename the column 'temperature' with 'temp'

In [0]:
df.rename(columns= {'temperature':'temp'})

         date      city  temp  humidity  Season
0  05-01-2017  new york    65        56  winter
1  05-01-2017  new york    61        54  winter
2  05-02-2017  new york    70        60  winter
3  05-02-2017  new york    71        62  winter
4  05-01-2017    mumbai    75        80  summer
5  05-01-2017    mumbai    78        83  summer
6  05-02-2017    mumbai    82        85  summer
7  05-02-2017    mumbai    80        26  summer

## Summary Statistics

In [0]:
import pandas as pd 

import csv
data = pd.read_csv("wine.csv", encoding="latin-1")

## Lets have a brief look at the first four rows of the data in table

In [0]:
data.head()

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,0,Italy,"Aromas include tropical fruit, broom, brimston...",VulkÃ Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin OâKeefe,@kerinokeefe,Nicosia 2013 VulkÃ Bianco (Etna),White Blend,Nicosia
1,1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwineÂ,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwineÂ,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks

#head function with no arguments gets the first five rows of data from the data frame so the output will be as above

## Head function in python with arguments

In [0]:
data.head(8)

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,0,Italy,"Aromas include tropical fruit, broom, brimston...",VulkÃ Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin OâKeefe,@kerinokeefe,Nicosia 2013 VulkÃ Bianco (Etna),White Blend,Nicosia
1,1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwineÂ,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwineÂ,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks
5,5,Spain,Blackberry and raspberry aromas show a typical...,Ars In Vitro,87,15.0,Northern Spain,Navarra,NaN,Michael Schachner,@wineschach,Tandem 2011 Ars In Vitro Tempranillo-Merlot (N...,Tempranillo-Merlot,Tandem
6,6,Italy,"Here's a bright, informal red that opens with ...",Belsito,87,16.0,Sicily & Sardinia,Vittoria,NaN,Kerin OâKeefe,@kerinokeefe,Terre di Giurfo 2013 Belsito Frappato (Vittoria),Frappato,Terre di Giurfo
7,7,France,This dry and restrained wine offers spice in p...,NaN,87,24.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Trimbach 2012 Gewurztraminer (Alsace),GewÃ¼rztraminer,Trimbach

head function with specified N arguments, gets the first N rows of data from the data frame so the output will be as above

In [0]:
data.tail()

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
129966,129966,Germany,Notes of honeysuckle and cantaloupe sweeten th...,Brauneberger Juffer-Sonnenuhr SpÃ¤tlese,90,28.0,Mosel,NaN,NaN,Anna Lee C. Iijima,NaN,Dr. H. Thanisch (Erben MÃ¼ller-Burggraef) 2013...,Riesling,Dr. H. Thanisch (Erben MÃ¼ller-Burggraef)
129967,129967,US,Citation is given as much as a decade of bottl...,NaN,90,75.0,Oregon,Oregon,Oregon Other,Paul Gregutt,@paulgwineÂ,Citation 2004 Pinot Noir (Oregon),Pinot Noir,Citation
129968,129968,France,Well-drained gravel soil gives this wine its c...,Kritt,90,30.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Gresser 2013 Kritt Gewurztraminer (Als...,GewÃ¼rztraminer,Domaine Gresser
129969,129969,France,"A dry style of Pinot Gris, this is crisp with ...",NaN,90,32.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Marcel Deiss 2012 Pinot Gris (Alsace),Pinot Gris,Domaine Marcel Deiss
129970,129970,France,"Big, rich and off-dry, this is powered by inte...",Lieu-dit Harth CuvÃ©e Caroline,90,21.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Schoffit 2012 Lieu-dit Harth CuvÃ©e Ca...,GewÃ¼rztraminer,Domaine Schoffit

tail function with no arguments gets the last five rows of data from the data frame so the output will be as above

## Tail function in python with arguments

In [0]:
data.tail(8)

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
129963,129963,Israel,"A bouquet of black cherry, tart cranberry and ...",Oak Aged,90,20.0,Galilee,NaN,NaN,Mike DeSimone,@worldwineguys,Dalton 2012 Oak Aged Cabernet Sauvignon (Galilee),Cabernet Sauvignon,Dalton
129964,129964,France,"Initially quite muted, this wine slowly develo...",Domaine Saint-RÃ©my Herrenweg,90,NaN,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Ehrhart 2013 Domaine Saint-RÃ©my Herre...,GewÃ¼rztraminer,Domaine Ehrhart
129965,129965,France,"While it's rich, this beautiful dry wine also ...",Seppi Landmann VallÃ©e Noble,90,28.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine RieflÃ©-Landmann 2013 Seppi Landmann V...,Pinot Gris,Domaine RieflÃ©-Landmann
129966,129966,Germany,Notes of honeysuckle and cantaloupe sweeten th...,Brauneberger Juffer-Sonnenuhr SpÃ¤tlese,90,28.0,Mosel,NaN,NaN,Anna Lee C. Iijima,NaN,Dr. H. Thanisch (Erben MÃ¼ller-Burggraef) 2013...,Riesling,Dr. H. Thanisch (Erben MÃ¼ller-Burggraef)
129967,129967,US,Citation is given as much as a decade of bottl...,NaN,90,75.0,Oregon,Oregon,Oregon Other,Paul Gregutt,@paulgwineÂ,Citation 2004 Pinot Noir (Oregon),Pinot Noir,Citation
129968,129968,France,Well-drained gravel soil gives this wine its c...,Kritt,90,30.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Gresser 2013 Kritt Gewurztraminer (Als...,GewÃ¼rztraminer,Domaine Gresser
129969,129969,France,"A dry style of Pinot Gris, this is crisp with ...",NaN,90,32.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Marcel Deiss 2012 Pinot Gris (Alsace),Pinot Gris,Domaine Marcel Deiss
129970,129970,France,"Big, rich and off-dry, this is powered by inte...",Lieu-dit Harth CuvÃ©e Caroline,90,21.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Schoffit 2012 Lieu-dit Harth CuvÃ©e Ca...,GewÃ¼rztraminer,Domaine Schoffit

tail function with specified N arguments, gets the last N rows of data from the data frame so the output will be as above

## describe() Function

## Lets get the Summary Statistic of the numeric columns:

In [0]:
data.describe()

          Unnamed: 0         points          price
count  129971.000000  129971.000000  120975.000000
mean    64985.000000      88.447138      35.363389
std     37519.540256       3.039730      41.022218
min         0.000000      80.000000       4.000000
25%     32492.500000      86.000000      17.000000
50%     64985.000000      88.000000      25.000000
75%     97477.500000      91.000000      42.000000
max    129970.000000     100.000000    3300.000000

describe() Function gives the mean, std and IQR values. It excludes character column and calculate summary statistics only for numeric columns

## Lets get the Summary Statistic of the character columns:

In [0]:
data.describe(include=['object'])

,country,description,designation,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
count,129908,129971,92506,129908,108724,50511,103727,98758,129971,129970,129971
unique,43,119955,37979,425,1229,17,19,15,118840,707,16757
top,US,"Cigar box, cafÃ© au lait, and dried tobacco ar...",Reserve,California,Napa Valley,Central Coast,Roger Voss,@vossroger,Gloria Ferrer NV Sonoma Brut Sparkling (Sonoma...,Pinot Noir,Wines & Winemakers
freq,54504,3,2009,36247,4480,11065,25514,25514,11,13272,222

describe() Function with an argument named include along with value object i.e include=’object’ gives the summary statistics of the character columns.

## Lets get the Summary Statistic of all the columns

In [0]:
data.describe(include='all')

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
count,129971.000000,129908,129971,92506,129971.000000,120975.000000,129908,108724,50511,103727,98758,129971,129970,129971
unique,NaN,43,119955,37979,NaN,NaN,425,1229,17,19,15,118840,707,16757
top,NaN,US,"Cigar box, cafÃ© au lait, and dried tobacco ar...",Reserve,NaN,NaN,California,Napa Valley,Central Coast,Roger Voss,@vossroger,Gloria Ferrer NV Sonoma Brut Sparkling (Sonoma...,Pinot Noir,Wines & Winemakers
freq,NaN,54504,3,2009,NaN,NaN,36247,4480,11065,25514,25514,11,13272,222
mean,64985.000000,NaN,NaN,NaN,88.447138,35.363389,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,37519.540256,NaN,NaN,NaN,3.039730,41.022218,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,NaN,NaN,NaN,80.000000,4.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,32492.500000,NaN,NaN,NaN,86.000000,17.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,64985.000000,NaN,NaN,NaN,88.000000,25.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,97477.500000,NaN,NaN,NaN,91.000000,42.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,129970.000000,NaN,NaN,NaN,100.000000,3300.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

describe() Function with include=’all’ gives the summary statistics of all the columns.

## Lets get the basic information about our data

In [0]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 129971 entries, 0 to 129970
Data columns (total 14 columns):
Unnamed: 0               129971 non-null int64
country                  129908 non-null object
description              129971 non-null object
designation              92506 non-null object
points                   129971 non-null int64
price                    120975 non-null float64
province                 129908 non-null object
region_1                 108724 non-null object
region_2                 50511 non-null object
taster_name              103727 non-null object
taster_twitter_handle    98758 non-null object
title                    129971 non-null object
variety                  129970 non-null object
winery                   129971 non-null object
dtypes: float64(1), int64(2), object(11)
memory usage: 13.9+ MB

##  Reading in data and looking at the number of rows and columns using shape function

In [2]:
import pandas as pd

In [4]:
NEIC = pd.read_csv('earthquake.csv',sep = ',')
NEIC.shape

(23412, 21)

## Identifying the unique factors of Earthquakes.

In [9]:
from numpy import *
print(unique(NEIC.Type))
print(NEIC['Magnitude Type'].unique())

['Earthquake' 'Explosion' 'Nuclear Explosion' 'Rock Burst']
['MW' 'ML' 'MH' 'MS' 'MB' 'MWC' 'MD' nan 'MWB' 'MWW' 'MWR']

##  Lets identify the minimum, maximum and average of the Magnitude of the earthquake

In [6]:
minimum=NEIC["Magnitude"].min()
maximum=NEIC["Magnitude"].max()
average=NEIC["Magnitude"].mean()

print("Minimum: " ,minimum)
print("Maximum: " ,maximum)
print("Average: " ,average)

Minimum:  5.5
Maximum:  9.1
Average:  5.882530753460003

## finding Highly effected areas , assuming the one with Magnitude >8

In [7]:
highly_effected=NEIC[NEIC["Magnitude"]>=8]
print(highly_effected)

             Date      Time  Latitude  Longitude        Type   Depth  \
11     01/24/1965  00:11:17   -2.6080   125.9520  Earthquake   20.00
16     02/04/1965  05:01:22   51.2510   178.7150  Earthquake   30.30
538    10/17/1966  21:42:00  -10.6650   -78.2280  Earthquake   40.00
911    05/16/1968  00:49:02   40.8600   143.4350  Earthquake   29.90
1663   07/31/1970  17:08:05   -1.5970   -72.5320  Earthquake  644.80
1983   07/14/1971  06:11:30   -5.5240   153.8500  Earthquake   40.00
2008   07/26/1971  01:23:22   -4.8170   153.1720  Earthquake   40.00
2530   12/02/1972  00:19:52    6.4050   126.6400  Earthquake   60.00
3770   01/14/1976  16:47:34  -28.4270  -177.6570  Earthquake   33.00
7415   03/03/1985  22:47:07  -33.1350   -71.8710  Earthquake   33.00
7699   09/19/1985  13:17:47   18.1900  -102.5330  Earthquake   27.90
7959   05/07/1986  22:47:11   51.5200  -174.7760  Earthquake   33.00
9484   05/23/1989  10:54:46  -52.3410   160.5680  Earthquake   10.00
11959  06/09/1994  00:33:16  -13.8410   -67.5530  Earthquake  631.30
12119  10/04/1994  13:22:56   43.7730   147.3210  Earthquake   14.00
12571  07/30/1995  05:11:24  -23.3400   -70.2940  Earthquake   45.60
12703  10/09/1995  15:35:54   19.0550  -104.2050  Earthquake   33.00
12892  02/17/1996  05:59:31   -0.8910   136.9520  Earthquake   33.00
13925  03/25/1998  03:12:25  -62.8770   149.5270  Earthquake   10.00
15116  11/16/2000  04:54:57   -3.9800   152.1690  Earthquake   33.00
15440  06/23/2001  20:33:14  -16.2650   -73.6410  Earthquake   33.00
16446  09/25/2003  19:50:06   41.8150   143.9100  Earthquake   27.00
17080  12/23/2004  14:59:04  -49.3120   161.3450  Earthquake   10.00
17083  12/26/2004  00:58:53    3.2950    95.9820  Earthquake   30.00
17329  03/28/2005  16:09:37    2.0850    97.1080  Earthquake   30.00
17858  05/03/2006  15:26:40  -20.1870  -174.1230  Earthquake   55.00
18111  11/15/2006  11:14:14   46.5920   153.2660  Earthquake   10.00
18211  01/13/2007  04:23:21   46.2430   154.5240  Earthquake   10.00
18346  04/01/2007  20:39:59   -8.4660   157.0430  Earthquake   24.00
18573  08/15/2007  23:40:58  -13.3860   -76.6030  Earthquake   39.00
18615  09/12/2007  11:10:27   -4.4380   101.3670  Earthquake   34.00
19661  09/29/2009  17:48:11  -15.4890  -172.0950  Earthquake   18.00
19928  02/27/2010  06:34:12  -36.1220   -72.8980  Earthquake   22.90
20501  03/11/2011  05:46:24   38.2970   142.3730  Earthquake   29.00
21219  04/11/2012  08:38:37    2.3270    93.0630  Earthquake   20.00
21224  04/11/2012  10:43:11    0.8020    92.4630  Earthquake   25.10
21589  02/06/2013  01:12:26  -10.7990   165.1140  Earthquake   24.00
21765  05/24/2013  05:44:49   54.8920   153.2210  Earthquake  598.10
22120  04/01/2014  23:46:47  -19.6097   -70.7691  Earthquake   25.00
22791  09/16/2015  22:54:33  -31.5729   -71.6744  Earthquake   22.44

       Depth Error  Depth Seismic Stations  Magnitude Magnitude Type  ...  \
11             NaN                     NaN        8.2             MW  ...
16             NaN                     NaN        8.7             MW  ...
538            NaN                     NaN        8.1             MW  ...
911            NaN                     NaN        8.2             MW  ...
1663           NaN                     NaN        8.0             MW  ...
1983           NaN                     NaN        8.0             MW  ...
2008           NaN                     NaN        8.1             MW  ...
2530           NaN                     NaN        8.0             MW  ...
3770           NaN                     NaN        8.0             MS  ...
7415           NaN                     NaN        8.0             MW  ...
7699           3.8                     NaN        8.0             MW  ...
7959           NaN                     NaN        8.0             MW  ...
9484           NaN                     NaN        8.2             MW  ...
11959          NaN                     NaN        8.2             MW  ...
12119          4.7                     NaN        8.3             MW  ...
12571          NaN                     NaN        8.0             MW  ...
12703          NaN                     NaN        8.0             MW  ...
12892          NaN                     NaN        8.2             MW  ...
13925          NaN                     NaN        8.1            MWC  ...
15116          NaN                   254.0        8.0            MWC  ...
15440          NaN                   518.0        8.4            MWW  ...
16446          NaN                   669.0        8.3            MWC  ...
17080          NaN                   331.0        8.1            MWC  ...
17083          NaN                   601.0        9.1             MW  ...
17329          NaN                   510.0        8.6            MWW  ...
17858          NaN                   626.0        8.0            MWC  ...
18111          NaN                   576.0        8.3            MWC  ...
18211          NaN                   606.0        8.1            MWC  ...
18346          NaN                   439.0        8.1            MWC  ...
18573          NaN                   625.0        8.0            MWC  ...
18615          NaN                   411.0        8.4            MWW  ...
19661          NaN                   520.0        8.1            MWC  ...
19928          9.2                   454.0        8.8            MWW  ...
20501          NaN                   541.0        9.1            MWW  ...
21219          NaN                   499.0        8.6             MW  ...
21224          7.3                   341.0        8.2            MWC  ...
21589          NaN                   460.0        8.0            MWW  ...
21765          4.1                   385.0        8.3            MWW  ...
22120          1.8                     NaN        8.2            MWW  ...
22791          3.2                     NaN        8.3            MWW  ...

       Magnitude Seismic Stations  Azimuthal Gap  Horizontal Distance  \
11                            NaN            NaN                  NaN
16                            NaN            NaN                  NaN
538                           NaN            NaN                  NaN
911                           NaN            NaN                  NaN
1663                          NaN            NaN                  NaN
1983                          NaN            NaN                  NaN
2008                          NaN            NaN                  NaN
2530                          NaN            NaN                  NaN
3770                          NaN            NaN                  NaN
7415                          NaN            NaN                  NaN
7699                          NaN            NaN                  NaN
7959                          NaN            NaN                  NaN
9484                          NaN            NaN                  NaN
11959                         NaN            NaN                  NaN
12119                         NaN            NaN                  NaN
12571                         NaN            NaN                  NaN
12703                         NaN            NaN                  NaN
12892                         NaN            NaN                  NaN
13925                         NaN            NaN                  NaN
15116                         NaN            NaN                  NaN
15440                         NaN            NaN                  NaN
16446                         NaN           27.4                  NaN
17080                         NaN           59.3                  NaN
17083                         NaN           22.0                  NaN
17329                         NaN           22.1                  NaN
17858                         NaN           20.7                  NaN
18111                         NaN           20.9                  NaN
18211                         NaN           14.0                  NaN
18346                         NaN           14.7                  NaN
18573                         NaN           25.7                  NaN
18615                         NaN           32.3                  NaN
19661                         NaN           20.8                  NaN
19928                         NaN           17.8                  NaN
20501                         NaN            9.5                  NaN
21219                         NaN           16.6                  NaN
21224                         NaN           14.9                  NaN
21589                         NaN           20.9                  NaN
21765                         NaN           10.0                  NaN
22120                         NaN           23.0                0.609
22791                         NaN           19.0                0.684

       Horizontal Error  Root Mean Square                            ID  \
11                  NaN               NaN                  ISCGEM861299
16                  NaN               NaN     OFFICIAL19650204050122_30
538                 NaN               NaN                  ISCGEM842581
911                 NaN               NaN                  ISCGEM821946
1663                NaN               NaN                  ISCGEM794176
1983                NaN               NaN                  ISCGEM782181
2008                NaN               NaN                  ISCGEM782684
2530                NaN               NaN                  ISCGEM765501
3770                NaN               NaN                    USP0000EE7
7415                NaN              1.00                    USP0002CCZ
7699                NaN              1.30                    USP0002JWE
7959                NaN              1.10                    USP0002TMU
9484                NaN              1.30                    USP0003VJ7
11959               NaN              1.10                    USP0006DZC
12119               NaN              0.90                    USP0006KDP
12571               NaN              1.10                    USP000714T
12703               NaN              1.30                    USP00074VC
12892               NaN              1.30                    USP0007D1W
13925               NaN              1.10                    USP0008HZD
15116               NaN              1.20                    USP000A3QQ
15440               NaN              1.05  OFFICIAL20010623203314130_33
16446               NaN              0.88                    USP000C8KV
17080               NaN              1.12                    USP000DB93
17083               NaN              1.17  OFFICIAL20041226005853450_30
17329               NaN              0.91  OFFICIAL20050328160936530_30
17858               NaN              1.18                    USP000EG5G
18111               NaN              1.07                    USP000EXFN
18211               NaN              1.12                    USP000F2AB
18346               NaN              1.32                    USP000F83M
18573               NaN              0.86                    USP000FJTA
18615               NaN              1.03  OFFICIAL20070912111026830_34
19661               NaN              1.01                    USP000H1YS
19928               NaN              1.09  OFFICIAL20100227063411530_30
20501               NaN              1.16  OFFICIAL20110311054624120_30
21219               NaN              1.33  OFFICIAL20120411083836720_20
21224               NaN              0.90                    USP000JHJB
21589               NaN              1.29                    USC000F1S0
21765               NaN              1.02                    USB000H4JH
22120               NaN              0.66                    USC000NZVD
22791               4.7              1.02                    US20003K7A

         Source Location Source Magnitude Source     Status
11       ISCGEM          ISCGEM           ISCGEM  Automatic
16     OFFICIAL          ISCGEM         OFFICIAL  Automatic
538      ISCGEM          ISCGEM           ISCGEM  Automatic
911      ISCGEM          ISCGEM           ISCGEM  Automatic
1663     ISCGEM          ISCGEM           ISCGEM  Automatic
1983     ISCGEM          ISCGEM           ISCGEM  Automatic
2008     ISCGEM          ISCGEM           ISCGEM  Automatic
2530     ISCGEM          ISCGEM           ISCGEM  Automatic
3770         US              US               US   Reviewed
7415         US              US              HRV   Reviewed
7699         US              US              HRV   Reviewed
7959         US              US              HRV   Reviewed
9484         US              US              PAR   Reviewed
11959        US              US              HRV   Reviewed
12119        US              US              HRV   Reviewed
12571        US              US              HRV   Reviewed
12703        US              US              HRV   Reviewed
12892        US              US              HRV   Reviewed
13925        US              US              HRV   Reviewed
15116        US              US              HRV   Reviewed
15440  OFFICIAL              US         OFFICIAL   Reviewed
16446        US              US              HRV   Reviewed
17080        US              US              HRV   Reviewed
17083  OFFICIAL              US         OFFICIAL   Reviewed
17329  OFFICIAL              US         OFFICIAL   Reviewed
17858        US              US              HRV   Reviewed
18111        US              US             GCMT   Reviewed
18211        US              US             GCMT   Reviewed
18346        US              US             GCMT   Reviewed
18573        US              US             GCMT   Reviewed
18615  OFFICIAL              US         OFFICIAL   Reviewed
19661        US              US             GCMT   Reviewed
19928  OFFICIAL              US         OFFICIAL   Reviewed
20501  OFFICIAL              US         OFFICIAL   Reviewed
21219  OFFICIAL              US         OFFICIAL   Reviewed
21224        US              US               US   Reviewed
21589        US              US               US   Reviewed
21765        US              US               US   Reviewed
22120        US              US               US   Reviewed
22791        US              US               US   Reviewed

[40 rows x 21 columns]

## skewness and kurtosis of Depth.

In [12]:
print("Skewness: %f" % NEIC['Depth'].skew())
print("Kurtosis: %f" % NEIC['Depth'].kurt()), encoding="latin-1"

Skewness: 3.290683
Kurtosis: 10.456851

In [20]:
data = pd.read_csv("wine.csv")

In [21]:
data.head()

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulkà Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin O’Keefe,@kerinokeefe,Nicosia 2013 Vulkà Bianco (Etna),White Blend,Nicosia
1,1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks

In [22]:
data.tail()

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
129966,129966,Germany,Notes of honeysuckle and cantaloupe sweeten th...,Brauneberger Juffer-Sonnenuhr Spätlese,90,28.0,Mosel,NaN,NaN,Anna Lee C. Iijima,NaN,Dr. H. Thanisch (Erben Müller-Burggraef) 2013 ...,Riesling,Dr. H. Thanisch (Erben Müller-Burggraef)
129967,129967,US,Citation is given as much as a decade of bottl...,NaN,90,75.0,Oregon,Oregon,Oregon Other,Paul Gregutt,@paulgwine,Citation 2004 Pinot Noir (Oregon),Pinot Noir,Citation
129968,129968,France,Well-drained gravel soil gives this wine its c...,Kritt,90,30.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Gresser 2013 Kritt Gewurztraminer (Als...,Gewürztraminer,Domaine Gresser
129969,129969,France,"A dry style of Pinot Gris, this is crisp with ...",NaN,90,32.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Marcel Deiss 2012 Pinot Gris (Alsace),Pinot Gris,Domaine Marcel Deiss
129970,129970,France,"Big, rich and off-dry, this is powered by inte...",Lieu-dit Harth Cuvée Caroline,90,21.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Schoffit 2012 Lieu-dit Harth Cuvée Car...,Gewürztraminer,Domaine Schoffit

## Lets find out the mean of the points

In [23]:
data['points'].mean() #Mean of the dataframe:

88.44713820775404

## Lets calculate the median of the specific Column

In [24]:
data['points'].median()

88.0

## Lets calculate the mode of the specific column

In [25]:
data['points'].mode()

0    88
dtype: int64

## Lets calculate the standard deviation of a data frame

In [26]:
data.std()

Unnamed: 0    37519.540256
points            3.039730
price            41.022218
dtype: float64

## Lets calculate the standard deviation of the data frame column wise

In [27]:
data.std(axis=0)

Unnamed: 0    37519.540256
points            3.039730
price            41.022218
dtype: float64

## Lets calculate the standard deviation of a specefic column "points"

In [28]:
data.loc[:,"points"].std()

3.0397302029162336

-----------------------

# ------------------------------------- HAPPY LEARNING --------------------------------------------

---------------------------------